In [2]:
import pandas as pd

In this notebook, I will clean and transform all the tables that then I will use in MySQL. There are some files in excel format (xls,xlsx) so I'm gonna convert them to csv format to make it easier when inserting the data into the tables. 

So, let's go ahead.

In [4]:
clientes_table = pd.read_csv("../../../Clase 01/Homework/Clientes.csv",encoding="utf-8",delimiter=";")

In [5]:
clientes_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3407 entries, 0 to 3406
Data columns (total 15 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           3407 non-null   int64
 1   Provincia                    3376 non-null   object
 2   Nombre_y_Apellido            3361 non-null   object
 3   Domicilio                    3359 non-null   object
 4   Telefono                     3317 non-null   object
 5   Edad                         3407 non-null   int64
 6   Localidad                    3375 non-null   object
 7   X                            3345 non-null   object
 8   Y                            3347 non-null   object
 9   Fecha_Alta                   3407 non-null   object
 10  Usuario_Alta                 3407 non-null   object
 11  Fecha_Ultima_Modificacion    3407 non-null   object
 12  Usuario_Ultima_Modificacion  3407 non-null   object
 13  Marca_Baja                   3407 non-null   int64
 14  col10                        0 non-null      float64
dtypes: float64(1), int64(3), object(11)
memory usage: 399.4+ KB

As you can see, the dataframe has one column completly empy (col10), so im gonna remove it from the df

In [7]:
clientes_table = clientes_table.drop(["col10"],axis=1)

Renaming the columns that express Longitude and Latitude

In [8]:
clientes_table.rename(columns={"X":"Longitud","Y":"Latitud"},inplace=True)

In [9]:
clientes_table["Latitud"] = clientes_table["Latitud"].astype("str")
clientes_table["Longitud"] = clientes_table["Longitud"].astype("str")

In [12]:
clientes_table.Longitud.head()

0    -58,81850307
1    -58,73073751
2    -59,12794068
3    -58,14393954
4      -58,089381
Name: Longitud, dtype: object

Since I need the columns in a decimal format, it's necessary to change the commas to dots

In [13]:
clientes_table["Latitud"] = clientes_table["Latitud"].apply(lambda x: x.replace(",","."))
clientes_table["Longitud"] = clientes_table["Longitud"].apply(lambda x: x.replace(",","."))

In [14]:
clientes_table.Longitud.head()

0    -58.81850307
1    -58.73073751
2    -59.12794068
3    -58.14393954
4      -58.089381
Name: Longitud, dtype: object

So now I have the dataframe in a better way. Let's check it out.

*Just in case, I won't delete the "Marca Baja" column because I don't know if later I will need it*

In [15]:
clientes_table.head(3)

,ID,Provincia,Nombre_y_Apellido,Domicilio,Telefono,Edad,Localidad,Longitud,Latitud,Fecha_Alta,Usuario_Alta,Fecha_Ultima_Modificacion,Usuario_Ultima_Modificacion,Marca_Baja
0,1,Buenos Aires,HEBER JONI SANTANA,LAS HERAS Y BAT. 24 DE FEBRERO 4150 RINCON DE...,42-5161,58,LOMA VERDE,-58.81850307,-34.30997088,2015-01-01,user1,2015-01-01,user1,0
1,2,Buenos Aires,ANA SAPRIZA,PUEYRREDON Y DUPUY RUTA3 KM 52.500 S/N BÂº LO...,49-7578,61,SANTA ROSA,-58.73073751,-34.93908311,2015-01-01,user1,2015-01-01,user1,0
2,3,Buenos Aires,FERNANDO LUIS SARALEGUI,CALDERON DE LA BARCA 498,49-3435,15,TORRES,-59.12794068,-34.43082199,2015-01-01,user1,2015-01-01,user1,0

In [9]:
clientes_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3407 entries, 0 to 3406
Data columns (total 14 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           3407 non-null   int64
 1   Provincia                    3376 non-null   object
 2   Nombre_y_Apellido            3361 non-null   object
 3   Domicilio                    3359 non-null   object
 4   Telefono                     3317 non-null   object
 5   Edad                         3407 non-null   int64
 6   Localidad                    3375 non-null   object
 7   Longitud                     3407 non-null   object
 8   Latitud                      3407 non-null   object
 9   Fecha_Alta                   3407 non-null   object
 10  Usuario_Alta                 3407 non-null   object
 11  Fecha_Ultima_Modificacion    3407 non-null   object
 12  Usuario_Ultima_Modificacion  3407 non-null   object
 13  Marca_Baja                   3407 non-null   int64
dtypes: int64(3), object(11)
memory usage: 372.8+ KB

So now this dataframe is able to export as csv format

In [9]:
clientes_table.to_csv("../../Homework/clientes_clean.csv",index=False,encoding="utf-8")

Now I do the same for the next tables

In [18]:
sucursales_table = pd.read_csv("../../../Clase 01/Homework/Sucursales.csv",delimiter=";",encoding="utf-8")

In [19]:
sucursales_table["Latitud"] = sucursales_table["Latitud"].apply(lambda x: x.replace(",","."))
sucursales_table["Longitud"] = sucursales_table["Longitud"].apply(lambda x: x.replace(",","."))

In [20]:
sucursales_table.head(3)

,ID,Sucursal,Direccion,Localidad,Provincia,Latitud,Longitud
0,1,Cabildo,Av. Cabildo 1342,Ciudad de Buenos Aires,Ciudad de Buenos Aires,-34.5678060,-58.4495720
1,2,Palermo 1,Guatemala 5701,CABA,CABA,-34.5790350,-58.4335660
2,3,Palermo 2,Gral. Lucio Norberto Mansilla 2668,CABA,C deBuenos Aires,-34.5959660,-58.4051500

In [30]:
sucursales_table.to_csv("../../Homework/Sucursales_clean.csv",index=False,encoding="utf-8")

In this point, the rest of the tables are in excel format, so to be able to convert them to CSV, I need to import 'openpyxl' and 'xlrd' libraries

In [21]:
import openpyxl
import xlrd

In [24]:
canalventa = pd.read_excel('../../../Clase 01/Homework/CanalDeVenta.xlsx')
canalventa.to_csv('../../Homework/CanalDeVenta_csv.csv',index=False,encoding="utf-8")

In [19]:
empleados = pd.read_excel('../../Homework/Empleados.xls')
empleados.to_csv('../../Homework/Empleados_csv.csv',index=False,encoding="utf-8")

In [21]:
productos = pd.read_excel('../../Homework/PRODUCTOS.xlsx')
productos.to_csv('../../Homework/Productos_csv.csv',index=False,encoding="utf-8")

In [22]:
proveedores = pd.read_excel('../../Homework/Proveedores.xlsx')
proveedores.to_csv('../../Homework/Proveedores_csv.csv',index=False,encoding="utf-8")

In [164]:
import random

In [28]:
empleados = pd.read_csv('../../../Clase 01/Homework/Empleados_csv.csv',encoding="utf-8")

In [29]:
empleados.head()

,ID_empleado,Apellido,Nombre,Sucursal,Sector,Cargo,Salario
0,1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000
1,1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000
2,1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000
3,1330,Ramirez,Eliana,Caseros,Administración,Vendedor,32000
4,1657,Carmona,Jose,Caseros,Administración,Vendedor,32000

In [30]:
empleados.ID_empleado.value_counts()

3875    3
1968    2
1725    2
3622    2
3842    2
       ..
1975    1
1759    1
1055    1
1054    1
3545    1
Name: ID_empleado, Length: 250, dtype: int64

I realized that in this table, there are many Id's that are duplicated form the column "ID_empleado", so here im gonna set them new ids to avoid mistakes so during the creation/insertion process of tables in MySQL

In [31]:
#Unique values only
unique_values = empleados.ID_empleado.unique()

# The amount of rows we have in the df (total of ID's)
total_values = len(empleados)

# A list with all the values between the minimum value and the maximum value
rango = list(range(unique_values.min(),unique_values.max() + 1))

# Removing the unique values from the range with all the values
for i in unique_values:
    rango.remove(i)

In [32]:
# The difference between the total of ID´s and the length from unique_values
dif = (total_values) - len(unique_values)

# A list with all the new's indexes
total = list(unique_values) + rango[:dif]
total.sort()
empleados["IdEmpleado"] = total

Once I got all the new ids, I won´t need any more the oldest ids so I delete them

In [33]:
empleados.drop(columns = ["ID_empleado"], inplace = True)

In [34]:
empleados = empleados[["IdEmpleado","Nombre","Apellido","Sucursal","Sector","Cargo","Salario"]]

In [35]:
empleados.head()

,IdEmpleado,Nombre,Apellido,Sucursal,Sector,Cargo,Salario
0,1011,Jeronimo,Burgos,Caseros,Administración,Administrativo,32000
1,1012,Estefania,Villegas,Caseros,Administración,Vendedor,32000
2,1013,Guillermo,Fernandez,Caseros,Administración,Vendedor,45000
3,1014,Eliana,Ramirez,Caseros,Administración,Vendedor,32000
4,1015,Jose,Carmona,Caseros,Administración,Vendedor,32000

In [10]:
empleados.to_csv("C:/Users/uriel/OneDrive/Documents/Capetas/Data Science/Soy Henry Contenido/Modulo 3/Clase 01/Homework/Empleados_clean.csv",index=False,encoding="utf-8")

That's all, I'm done with the cleaning/transforming process